In [1]:
import pandas as pd
import numpy as np

In [2]:
a = 5
d = 7
a*d

35

In [3]:
one = ['cat1','cat2','cat1','cat2']
two = [1,3,5,7]
three = [8,6,4,2]
df = pd.DataFrame(np.c_[one,two,three],columns=['cat','one','two'])
df

    cat one two
0  cat1   1   8
1  cat2   3   6
2  cat1   5   4
3  cat2   7   2

In [4]:
four = [0,1,0,1]
df['four'] = four
df

    cat one two  four
0  cat1   1   8     0
1  cat2   3   6     1
2  cat1   5   4     0
3  cat2   7   2     1